# **Pandas**

In [531]:
import pandas as pd
import openpyxl

## **1. Creating, Reading, and Writing Data**

### Creating a DataFrame

A DataFrame is the main data structure in Pandas, which represents a table with rows and columns. A DataFrame can be created from various sources: dictionaries, lists, NumPy arrays, and other data structures.

#### Example 1: Creating a DataFrame from a Dictionary

In [532]:
# Creating a DataFrame from a dictionary
data = {
    'Name': ['Alexey', 'Maria', 'Ivan'],
    'Age': [25, 30, 22],
    'City': ['Moscow', 'St. Petersburg', 'Novosibirsk']
}

df = pd.DataFrame(data)
print(df)

     Name  Age            City
0  Alexey   25          Moscow
1   Maria   30  St. Petersburg
2    Ivan   22     Novosibirsk

#### Example 2: Creating a DataFrame from a List of Lists

In [533]:
# Creating a DataFrame from a list of lists
data = [
    ['Alexey', 25, 'Moscow'],
    ['Maria', 30, 'St. Petersburg'],
    ['Ivan', 22, 'Novosibirsk']
]

df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
print(df)

     Name  Age            City
0  Alexey   25          Moscow
1   Maria   30  St. Petersburg
2    Ivan   22     Novosibirsk

#### Example 3: Creating a DataFrame with Specified Indices

In [534]:
# Creating a DataFrame with specified indices
data = [
    ['Alexey', 25, 'Moscow'],
    ['Maria', 30, 'St. Petersburg'],
    ['Ivan', 22, 'Novosibirsk']
]

df = pd.DataFrame(data, columns=['Name', 'Age', 'City'], index=['a', 'b', 'c'])
print(df)

     Name  Age            City
a  Alexey   25          Moscow
b   Maria   30  St. Petersburg
c    Ivan   22     Novosibirsk

### Reading Data from a File

Pandas supports reading data from various formats such as CSV, Excel, JSON, and others.

#### Example 4: Reading Data from a CSV File

In [535]:
# Reading a CSV file
df = pd.read_csv('data.csv')
print(df)

        Name  Age  Salary             City    HireDate
0     Zhanna   33   89811           Moscow  2022-02-28
1     Galina   55   42811    Yekaterinburg  2019-09-30
2       Ivan   54   96250            Kazan  2017-05-31
3     Dmitry   44  112082      Novosibirsk  2021-06-30
4     Zhanna   45   74754           Moscow  2022-08-31
..       ...  ...     ...              ...         ...
95  Lyudmila   30   72635            Kazan  2016-11-30
96    Kirill   27  103208      Novosibirsk  2020-02-29
97    Zhanna   37   73828  SaintPetersburg  2022-12-31
98    Kirill   50   58711            Kazan  2018-01-31
99      Ivan   24   43420    Yekaterinburg  2015-12-31

[100 rows x 5 columns]

#### Example 5: Reading Data from an Excel File

In [536]:
# Reading an Excel file
df = pd.read_excel('data.xlsx')
print(df)

        Name  Age  Salary             City    HireDate
0     Zhanna   33   89811           Moscow  2022-02-28
1     Galina   55   42811    Yekaterinburg  2019-09-30
2       Ivan   54   96250            Kazan  2017-05-31
3     Dmitry   44  112082      Novosibirsk  2021-06-30
4     Zhanna   45   74754           Moscow  2022-08-31
..       ...  ...     ...              ...         ...
95  Lyudmila   30   72635            Kazan  2016-11-30
96    Kirill   27  103208      Novosibirsk  2020-02-29
97    Zhanna   37   73828  SaintPetersburg  2022-12-31
98    Kirill   50   58711            Kazan  2018-01-31
99      Ivan   24   43420    Yekaterinburg  2015-12-31

[100 rows x 5 columns]

#### Example 6: Reading Data from a JSON File

In [537]:
# Reading a JSON file
df = pd.read_json('data.json')
print(df)

        Name  Age  Salary             City    HireDate
0     Zhanna   33   89811           Moscow  2022-02-28
1     Galina   55   42811    Yekaterinburg  2019-09-30
2       Ivan   54   96250            Kazan  2017-05-31
3     Dmitry   44  112082      Novosibirsk  2021-06-30
4     Zhanna   45   74754           Moscow  2022-08-31
..       ...  ...     ...              ...         ...
95  Lyudmila   30   72635            Kazan  2016-11-30
96    Kirill   27  103208      Novosibirsk  2020-02-29
97    Zhanna   37   73828  SaintPetersburg  2022-12-31
98    Kirill   50   58711            Kazan  2018-01-31
99      Ivan   24   43420    Yekaterinburg  2015-12-31

[100 rows x 5 columns]

### Writing Data to a File

Pandas also supports writing data to various formats.

#### Example 7: Writing a DataFrame to a CSV File

In [538]:
# Writing a DataFrame to a CSV file
df.to_csv('output.csv', index=False)

# Note: The `index=False` parameter indicates that the index should not be written to the file.

#### Example 8: Writing a DataFrame to an Excel File

In [539]:
# Writing a DataFrame to an Excel file
df.to_excel('output.xlsx', index=False)

#### Example 9: Writing a DataFrame to a JSON File

In [540]:
# Writing a DataFrame to a JSON file
df.to_json('output.json')

In [541]:
df.to_json('output.json', orient='records', indent=4, force_ascii=True)

Parameters of the `to_json()` method

`orient`:
- 'records' – saves data as a list of dictionaries (each dictionary is a row in the DataFrame).
- 'split' – saves data as separate keys: index, columns, data.
- 'index' – uses indices as top-level keys.
- 'columns' – uses column names as top-level keys.
- 'values' – saves only values (without indices and column names).
- 'table' – saves data in a format compatible with Table Schema.

`indent`:
- Specifies the number of spaces for indentation. If indent is not specified, JSON will be saved in one line.

`force_ascii`:
- If False, non-ASCII characters (e.g., Cyrillic) are saved as is. If True, they are converted to escape sequences.

## **2. Indexing, Selection, and Assignment**

In Pandas, there are several ways to select data from a DataFrame. In this section, we will look at the main methods of indexing, selection, and data assignment.

### Selecting Columns

#### Example 1: Selecting a Single Column
To select a single column, use the syntax `df['column_name']`.

In [542]:
# Creating a DataFrame
data = {
    'Name': ['Alexey', 'Maria', 'Ivan'],
    'Age': [25, 30, 22],
    'City': ['Moscow', 'St. Petersburg', 'Novosibirsk']
}
df = pd.DataFrame(data)

# Selecting the "Name" column
names = df['Name']
print(names)

0    Alexey
1     Maria
2      Ivan
Name: Name, dtype: object

#### Example 2: Selecting Multiple Columns
To select multiple columns, use the syntax `df[['column1', 'column2']]`.

In [543]:
# Selecting the "Name" and "City" columns
subset = df[['Name', 'City']]
print(subset)

     Name            City
0  Alexey          Moscow
1   Maria  St. Petersburg
2    Ivan     Novosibirsk

### Selecting Rows

#### Example 3: Selecting Rows by Index Using `.iloc`
The `.iloc` method is used to select rows by their numerical index.

In [544]:
# Selecting the first row
first_row = df.iloc[0]
print(first_row)

Name    Alexey
Age         25
City    Moscow
Name: 0, dtype: object

#### Example 4: Selecting Multiple Rows by Index

In [545]:
# Selecting the first two rows
first_two_rows = df.iloc[:2]
print(first_two_rows)

     Name  Age            City
0  Alexey   25          Moscow
1   Maria   30  St. Petersburg

#### Example 5: Selecting Rows by Condition
To select rows by condition, use boolean indexing.

In [546]:
# Selecting rows where age is greater than 25
adults = df[df['Age'] > 25]
print(adults)

    Name  Age            City
1  Maria   30  St. Petersburg

### Selecting Specific Cells

#### Example 6: Selecting a Value by Row and Column Index Using `.iloc`

In [547]:
# Selecting a value from the first row and second column
value = df.iloc[0, 1]
print(value)

25

#### Example 7: Selecting a Value by Row and Column Label Using `.loc`
The `.loc` method is used to select data by row and column labels.

In [548]:
# Selecting a value from the row with index 0 and the "Age" column
value = df.loc[0, 'Age']
print(value)

25

### Assigning Values

#### Example 8: Assigning a Value to an Entire Column

In [549]:
# Changing values in the "Age" column
df['Age'] = [26, 31, 23]
print(df)

     Name  Age            City
0  Alexey   26          Moscow
1   Maria   31  St. Petersburg
2    Ivan   23     Novosibirsk

#### Example 9: Assigning a Value to a Specific Cell

In [550]:
# Changing a value in the first row and "Age" column
df.at[0, 'Age'] = 27
print(df)

     Name  Age            City
0  Alexey   27          Moscow
1   Maria   31  St. Petersburg
2    Ivan   23     Novosibirsk

#### Example 10: Assigning Values Using a Condition

In [551]:
# Increasing age by 1 for everyone older than 25
df.loc[df['Age'] > 25, 'Age'] += 1
print(df)

     Name  Age            City
0  Alexey   28          Moscow
1   Maria   32  St. Petersburg
2    Ivan   23     Novosibirsk

#### Example 11: Selecting Rows Using `.isin`
The `.isin` method allows selecting rows where the column value is in a given list.

In [552]:
# Selecting rows where the city is Moscow or Novosibirsk
result = df[df['City'].isin(['Moscow', 'Novosibirsk'])]
print(result)

     Name  Age         City
0  Alexey   28       Moscow
2    Ivan   23  Novosibirsk

## **3. Summary Functions and Maps**

In Pandas, there are many functions for analyzing and transforming data. In this section, we will look at the main summary functions and methods for applying functions to data (maps).

### Summary Functions (Summary Functions)

Summary functions allow you to quickly get statistical information about the data.

#### Example 1: Basic Summary Functions

In [553]:
df = pd.read_csv('data.csv')

# Mean value
mean_age = df['Age'].mean()
print(f"Average age: {mean_age}")

# Median
median_salary = df['Salary'].median()
print(f"Median salary: {median_salary}")

# Minimum value
min_age = df['Age'].min()
print(f"Minimum age: {min_age}")

# Maximum value
max_salary = df['Salary'].max()
print(f"Maximum salary: {max_salary}")

# Standard deviation
std_age = df['Age'].std()
print(f"Standard deviation of age: {std_age}")

Average age: 40.95
Median salary: 79587.0
Minimum age: 22
Maximum salary: 119909
Standard deviation of age: 11.921777882463164

#### Example 2: Descriptive Statistics Using `.describe()`

The `.describe()` method provides basic statistical characteristics for numerical columns.

In [554]:
# Descriptive statistics
stats = df.describe()
print(stats)

              Age         Salary
count  100.000000     100.000000
mean    40.950000   77400.380000
std     11.921778   23653.001401
min     22.000000   41802.000000
25%     30.000000   56577.250000
50%     43.500000   79587.000000
75%     53.000000   96310.250000
max     59.000000  119909.000000

In [555]:
# Getting information about the data
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      100 non-null    object
 1   Age       100 non-null    int64
 2   Salary    100 non-null    int64
 3   City      100 non-null    object
 4   HireDate  100 non-null    object
dtypes: int64(2), object(3)
memory usage: 4.0+ KB
None

#### Example 3: Unique Values and Their Count

In [556]:
# Unique values in the "Name" column
unique_names = df['Name'].unique()
print(f"Unique names: {unique_names}")

# Number of unique values
num_unique_names = df['Name'].nunique()
print(f"Number of unique names: {num_unique_names}")

# Frequency of each unique value
name_counts = df['Name'].value_counts()
print(name_counts)

Unique names: ['Zhanna' 'Galina' 'Ivan' 'Dmitry' 'Lyudmila' 'Viktor' 'Elena' 'Boris'
 'Anna' 'Kirill']
Number of unique names: 10
Name
Ivan        15
Kirill      12
Lyudmila    11
Zhanna      11
Boris       10
Dmitry      10
Galina       9
Viktor       9
Anna         7
Elena        6
Name: count, dtype: int64

### Applying Functions to Data (Maps)

#### Example 4: Applying a Function to a Column Using `.apply()`

The `.apply()` method allows applying a function to each element of a column.

In [557]:
# Increasing age by 1 year
df['Age'] = df['Age'].apply(lambda x: x + 1)
print(df)

        Name  Age  Salary             City    HireDate
0     Zhanna   34   89811           Moscow  2022-02-28
1     Galina   56   42811    Yekaterinburg  2019-09-30
2       Ivan   55   96250            Kazan  2017-05-31
3     Dmitry   45  112082      Novosibirsk  2021-06-30
4     Zhanna   46   74754           Moscow  2022-08-31
..       ...  ...     ...              ...         ...
95  Lyudmila   31   72635            Kazan  2016-11-30
96    Kirill   28  103208      Novosibirsk  2020-02-29
97    Zhanna   38   73828  SaintPetersburg  2022-12-31
98    Kirill   51   58711            Kazan  2018-01-31
99      Ivan   25   43420    Yekaterinburg  2015-12-31

[100 rows x 5 columns]

### Working with Categorical Data

#### Example 5: Converting Data to Categories

In [558]:
# Converting the "Name" column to a categorical type
df['Name'] = df['Name'].astype('category')
print(df['Name'].cat.categories)

Index(['Anna', 'Boris', 'Dmitry', 'Elena', 'Galina', 'Ivan', 'Kirill',
       'Lyudmila', 'Viktor', 'Zhanna'],
      dtype='object')

#### Example 6: Applying a Function to Categorical Data

In [559]:
# Applying a function to categorical data
df['Name'] = df['Name'].apply(lambda x: x.lower())
print(df)

        Name  Age  Salary             City    HireDate
0     zhanna   34   89811           Moscow  2022-02-28
1     galina   56   42811    Yekaterinburg  2019-09-30
2       ivan   55   96250            Kazan  2017-05-31
3     dmitry   45  112082      Novosibirsk  2021-06-30
4     zhanna   46   74754           Moscow  2022-08-31
..       ...  ...     ...              ...         ...
95  lyudmila   31   72635            Kazan  2016-11-30
96    kirill   28  103208      Novosibirsk  2020-02-29
97    zhanna   38   73828  SaintPetersburg  2022-12-31
98    kirill   51   58711            Kazan  2018-01-31
99      ivan   25   43420    Yekaterinburg  2015-12-31

[100 rows x 5 columns]

### Working with Missing Values

#### Example 7: Filling Missing Values

In [560]:
# Adding missing values
df.loc[1, 'Salary'] = None

# Filling missing values with the mean value
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())
print(df)

        Name  Age         Salary             City    HireDate
0     zhanna   34   89811.000000           Moscow  2022-02-28
1     galina   56   77749.767677    Yekaterinburg  2019-09-30
2       ivan   55   96250.000000            Kazan  2017-05-31
3     dmitry   45  112082.000000      Novosibirsk  2021-06-30
4     zhanna   46   74754.000000           Moscow  2022-08-31
..       ...  ...            ...              ...         ...
95  lyudmila   31   72635.000000            Kazan  2016-11-30
96    kirill   28  103208.000000      Novosibirsk  2020-02-29
97    zhanna   38   73828.000000  SaintPetersburg  2022-12-31
98    kirill   51   58711.000000            Kazan  2018-01-31
99      ivan   25   43420.000000    Yekaterinburg  2015-12-31

[100 rows x 5 columns]

## **4. Grouping and Sorting**

Grouping and sorting data are important operations for data analysis and processing. In Pandas, the `.groupby()` and `.sort_values()` methods are used for this.

### Grouping Data (Grouping)

Grouping allows dividing data into groups based on certain criteria and performing aggregation (e.g., counting, summing, finding the average, etc.).

#### Example 1: Grouping by a Single Column

In [561]:
df = pd.read_csv('data.csv')

# Grouping by the "City" column and calculating the sum of sales
grouped = df.groupby('City')['Salary'].max()
print(grouped)

City
Kazan              119909
Moscow             117371
Novosibirsk        114290
SaintPetersburg    116213
Yekaterinburg      110271
Name: Salary, dtype: int64

#### Example 2: Aggregating Data After Grouping

The `.agg()` method allows applying multiple aggregation functions simultaneously.

In [562]:
# Grouping by the "City" column and applying multiple aggregation functions
grouped = df.groupby('City')['Salary'].agg(['sum', 'mean', 'count'])
print(grouped)

                     sum          mean  count
City
Kazan            1211539  86538.500000     14
Moscow           1628948  85734.105263     19
Novosibirsk      1460275  76856.578947     19
SaintPetersburg  1928071  71410.037037     27
Yekaterinburg    1511205  71962.142857     21

### Sorting Data (Sorting)

Sorting data allows ordering the rows of a DataFrame based on the values of one or more columns.

#### Example 3: Sorting by a Single Column

In [563]:
# Sorting by the "Salary" column in ascending order
sorted_df = df.sort_values(by='Salary')
print(sorted_df)

        Name  Age  Salary             City    HireDate
12      Ivan   58   41802  SaintPetersburg  2022-06-30
24    Kirill   34   42049            Kazan  2017-10-31
49      Ivan   22   42200  SaintPetersburg  2019-03-31
47    Galina   46   42557    Yekaterinburg  2017-09-30
1     Galina   55   42811    Yekaterinburg  2019-09-30
..       ...  ...     ...              ...         ...
85      Ivan   38  114543  SaintPetersburg  2021-01-31
75  Lyudmila   54  116213  SaintPetersburg  2015-07-31
23     Elena   47  117371           Moscow  2023-04-30
53     Boris   27  117505            Kazan  2020-05-31
71    Dmitry   49  119909            Kazan  2017-02-28

[100 rows x 5 columns]

#### Example 4: Sorting by Multiple Columns

In [564]:
# Sorting by the "City" and "Salary" columns
sorted_df = df.sort_values(by=['City', 'Salary'])
print(sorted_df)

        Name  Age  Salary           City    HireDate
24    Kirill   34   42049          Kazan  2017-10-31
73    Dmitry   58   43436          Kazan  2022-06-30
98    Kirill   50   58711          Kazan  2018-01-31
17      Ivan   47   61918          Kazan  2023-04-30
40    Kirill   27   69299          Kazan  2022-07-31
..       ...  ...     ...            ...         ...
79    Kirill   47   89377  Yekaterinburg  2017-05-31
89    Viktor   55   96491  Yekaterinburg  2019-01-31
55    Galina   48  101135  Yekaterinburg  2018-04-30
7     Zhanna   43  107270  Yekaterinburg  2022-10-31
63  Lyudmila   45  110271  Yekaterinburg  2018-10-31

[100 rows x 5 columns]

#### Example 5: Sorting in Descending Order

In [565]:
# Sorting by the "Salary" column in descending order
sorted_df = df.sort_values(by='Salary', ascending=False)
print(sorted_df)

        Name  Age  Salary             City    HireDate
71    Dmitry   49  119909            Kazan  2017-02-28
53     Boris   27  117505            Kazan  2020-05-31
23     Elena   47  117371           Moscow  2023-04-30
75  Lyudmila   54  116213  SaintPetersburg  2015-07-31
85      Ivan   38  114543  SaintPetersburg  2021-01-31
..       ...  ...     ...              ...         ...
1     Galina   55   42811    Yekaterinburg  2019-09-30
47    Galina   46   42557    Yekaterinburg  2017-09-30
49      Ivan   22   42200  SaintPetersburg  2019-03-31
24    Kirill   34   42049            Kazan  2017-10-31
12      Ivan   58   41802  SaintPetersburg  2022-06-30

[100 rows x 5 columns]

### Combining Grouping and Sorting

#### Example 6: Grouping and Sorting Results

In [566]:
# Grouping by the "City" column and calculating the sum of sales
grouped = df.groupby('City')['Salary'].sum()

# Sorting the grouping results
sorted_grouped = grouped.sort_values(ascending=False)
print(sorted_grouped)

City
SaintPetersburg    1928071
Moscow             1628948
Yekaterinburg      1511205
Novosibirsk        1460275
Kazan              1211539
Name: Salary, dtype: int64

#### Example 7: Grouping, Aggregation, and Sorting

In [567]:
# Grouping by the "City" column, aggregation, and sorting
result = df.groupby('City').agg({
    'Salary': ['sum', 'mean'],
    'Name': 'count'
}).sort_values(by=('Salary', 'sum'), ascending=False)
print(result)

                  Salary                Name
                     sum          mean count
City
SaintPetersburg  1928071  71410.037037    27
Moscow           1628948  85734.105263    19
Yekaterinburg    1511205  71962.142857    21
Novosibirsk      1460275  76856.578947    19
Kazan            1211539  86538.500000    14

In [568]:
# Counting the Number of People in Each City
df_counts = df['City'].value_counts()
print(df_counts)

City
SaintPetersburg    27
Yekaterinburg      21
Moscow             19
Novosibirsk        19
Kazan              14
Name: count, dtype: int64

## **5. Data Types and Missing Values**

Working with data types and missing values is an important part of data processing. Pandas provides powerful tools for managing data types and handling missing values.

### Data Types

Each column in a DataFrame has a specific data type. Pandas automatically infers data types when creating a DataFrame, but they can be manually changed.

#### Example 1: Viewing Data Types

In [569]:
# Create a DataFrame
data = {
    'Name': ['Alexey', 'Maria', 'Ivan'],
    'Age': [25, 30, 22],
    'Salary': [50000.0, 60000.0, 45000.0],
    'Hire_Date': ['2021-01-01', '2020-05-15', '2019-11-20']
}
df = pd.DataFrame(data)

# View data types
print(df.dtypes)

Name          object
Age            int64
Salary       float64
Hire_Date     object
dtype: object

#### Example 2: Changing Data Types

In [570]:
# Change the data type of the "Age" column to float
df['Age'] = df['Age'].astype(float)
print(df.dtypes)

Name          object
Age          float64
Salary       float64
Hire_Date     object
dtype: object

#### Example 3: Converting Strings to Dates

In [571]:
# Convert the "Hire_Date" column to datetime type
df['Hire_Date'] = pd.to_datetime(df['Hire_Date'])
print(df.dtypes)

Name                 object
Age                 float64
Salary              float64
Hire_Date    datetime64[ns]
dtype: object

### Missing Values

Missing values can occur for various reasons, and Pandas provides tools to handle them.

#### Example 4: Detecting Missing Values

In [572]:
# Add missing values
df.loc[1, 'Salary'] = None
df.loc[2, 'Age'] = None

# Check for missing values using isna and isnull
print(df.isna())

    Name    Age  Salary  Hire_Date
0  False  False   False      False
1  False  False    True      False
2  False   True   False      False

#### Example 5: Counting Missing Values

In [573]:
# Count missing values in each column
print(df.isnull().sum())

Name         0
Age          1
Salary       1
Hire_Date    0
dtype: int64

#### Example 6: Filling Missing Values

In [574]:
# Fill missing values in the "Salary" column with the mean value
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())

# Fill missing values in the "Age" column with the median value
df['Age'] = df['Age'].fillna(df['Age'].median())

print(df)

     Name   Age   Salary  Hire_Date
0  Alexey  25.0  50000.0 2021-01-01
1   Maria  30.0  47500.0 2020-05-15
2    Ivan  27.5  45000.0 2019-11-20

#### Example 7: Removing Rows with Missing Values

In [575]:
# Remove rows with any missing values
df_cleaned = df.dropna()
print(df_cleaned)

     Name   Age   Salary  Hire_Date
0  Alexey  25.0  50000.0 2021-01-01
1   Maria  30.0  47500.0 2020-05-15
2    Ivan  27.5  45000.0 2019-11-20

#### Example 8: Filling Missing Values Using Interpolation

In [576]:
# Interpolate missing values
df['Age'] = df['Age'].interpolate()
print(df)

     Name   Age   Salary  Hire_Date
0  Alexey  25.0  50000.0 2021-01-01
1   Maria  30.0  47500.0 2020-05-15
2    Ivan  27.5  45000.0 2019-11-20

### Working with Categorical Data

#### Example 9: Converting Data to Categories

In [577]:
# Convert the "Name" column to categorical type
df['Name'] = df['Name'].astype('category')
print(df['Name'].cat.categories)

Index(['Alexey', 'Ivan', 'Maria'], dtype='object')

#### Example 10: Adding a New Category

In [578]:
# Add a new category
df['Name'] = df['Name'].cat.add_categories(['Olga'])
print(df['Name'].cat.categories)

Index(['Alexey', 'Ivan', 'Maria', 'Olga'], dtype='object')

### Additional Examples

#### Example 11: Replacing Values

In [579]:
# Replace the value "Maria" with "Marina" in the "Name" column
df['Name'] = df['Name'].replace('Maria', 'Marina')
print(df)

     Name   Age   Salary  Hire_Date
0  Alexey  25.0  50000.0 2021-01-01
1  Marina  30.0  47500.0 2020-05-15
2    Ivan  27.5  45000.0 2019-11-20

C:\Users\admin\AppData\Local\Temp\ipykernel_26344\2124603055.py:2: FutureWarning: The behavior of Series.replace (and DataFrame.replace) with CategoricalDtype is deprecated. In a future version, replace will only be used for cases that preserve the categories. To change the categories, use ser.cat.rename_categories instead.
  df['Name'] = df['Name'].replace('Maria', 'Marina')

## **6. Renaming and Combining**

Pandas provides convenient tools for renaming columns and indices, as well as for combining data from different sources. In this section, we will look at how to rename columns and indices, and how to combine DataFrames using various methods.

### Renaming

#### Example 1: Renaming Columns

In [580]:
# Create a DataFrame
data = {
    'Name': ['Alexey', 'Maria', 'Ivan'],
    'Age': [25, 30, 22],
    'City': ['Moscow', 'St. Petersburg', 'Novosibirsk']
}
df = pd.DataFrame(data)

# Rename columns
df = df.rename(columns={
    'Name': 'Full Name',
    'Age': 'Age, years',
    'City': 'Residence'
})
print(df)

  Full Name  Age, years       Residence
0    Alexey          25          Moscow
1     Maria          30  St. Petersburg
2      Ivan          22     Novosibirsk

#### Example 2: Renaming Indices

In [581]:
# Rename indices
df = df.rename(index={0: 'a', 1: 'b', 2: 'c'})
print(df)

  Full Name  Age, years       Residence
a    Alexey          25          Moscow
b     Maria          30  St. Petersburg
c      Ivan          22     Novosibirsk

#### Example 3: Renaming Using `.columns`

In [582]:
# Rename columns directly using the .columns attribute
df.columns = ['Full Name', 'Age', 'City']
print(df)

  Full Name  Age            City
a    Alexey   25          Moscow
b     Maria   30  St. Petersburg
c      Ivan   22     Novosibirsk

### Combining Data

#### Example 4: Combining Rows with `pd.concat()`

In [583]:
# Create two DataFrames
df1 = pd.DataFrame({
    'Name': ['Alexey', 'Maria'],
    'Age': [25, 30]
})

df2 = pd.DataFrame({
    'Name': ['Ivan', 'Olga'],
    'Age': [22, 28]
})

# Combine rows
result = pd.concat([df1, df2], ignore_index=True)
print(result)

     Name  Age
0  Alexey   25
1   Maria   30
2    Ivan   22
3    Olga   28

#### Example 5: Combining Columns

In [584]:
# Combine columns
result = pd.concat([df1, df2], axis=1)
print(result)

     Name  Age  Name  Age
0  Alexey   25  Ivan   22
1   Maria   30  Olga   28

#### Example 6: Combining with `pd.merge()`

In [585]:
# Create two DataFrames
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alexey', 'Maria', 'Ivan']
})

df2 = pd.DataFrame({
    'ID': [1, 2, 4],
    'Salary': [50000, 60000, 45000]
})

# Inner join
result = pd.merge(df1, df2, on='ID', how='inner')
print(result)

   ID    Name  Salary
0   1  Alexey   50000
1   2   Maria   60000

#### Example 7: Combining with Different Types of JOIN

In [586]:
# Left join
result = pd.merge(df1, df2, on='ID', how='left')
print(result)
print()

# Outer join
result = pd.merge(df1, df2, on='ID', how='outer')
print(result)

   ID    Name   Salary
0   1  Alexey  50000.0
1   2   Maria  60000.0
2   3    Ivan      NaN

   ID    Name   Salary
0   1  Alexey  50000.0
1   2   Maria  60000.0
2   3    Ivan      NaN
3   4     NaN  45000.0

#### Example 8: Combining on Multiple Keys

In [587]:
# Create two DataFrames
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'City': ['Moscow', 'St. Petersburg', 'Novosibirsk'],
    'Name': ['Alexey', 'Maria', 'Ivan']
})

df2 = pd.DataFrame({
    'ID': [1, 2, 4],
    'City': ['Moscow', 'St. Petersburg', 'Kazan'],
    'Salary': [50000, 60000, 45000]
})

# Combine on multiple keys
result = pd.merge(df1, df2, on=['ID', 'City'], how='inner')
print(result)

   ID            City    Name  Salary
0   1          Moscow  Alexey   50000
1   2  St. Petersburg   Maria   60000

## **7. Modifying Data**

In [588]:
df = pd.read_csv('data.csv')
df.head()

     Name  Age  Salary           City    HireDate
0  Zhanna   33   89811         Moscow  2022-02-28
1  Galina   55   42811  Yekaterinburg  2019-09-30
2    Ivan   54   96250          Kazan  2017-05-31
3  Dmitry   44  112082    Novosibirsk  2021-06-30
4  Zhanna   45   74754         Moscow  2022-08-31

### Example 1: Adding New Columns

In [589]:
df['Salary 2'] = df['Salary'] * 0.87  # Calculate income after tax
print(df.head())

     Name  Age  Salary           City    HireDate  Salary 2
0  Zhanna   33   89811         Moscow  2022-02-28  78135.57
1  Galina   55   42811  Yekaterinburg  2019-09-30  37245.57
2    Ivan   54   96250          Kazan  2017-05-31  83737.50
3  Dmitry   44  112082    Novosibirsk  2021-06-30  97511.34
4  Zhanna   45   74754         Moscow  2022-08-31  65035.98

### Example 2: Removing Columns

In [590]:
df.drop(columns=['Salary 2'], inplace=True)  # Remove the 'City' column
print(df.head())

     Name  Age  Salary           City    HireDate
0  Zhanna   33   89811         Moscow  2022-02-28
1  Galina   55   42811  Yekaterinburg  2019-09-30
2    Ivan   54   96250          Kazan  2017-05-31
3  Dmitry   44  112082    Novosibirsk  2021-06-30
4  Zhanna   45   74754         Moscow  2022-08-31

### Example 3: Removing Duplicates

Often, data contains duplicate rows that need to be removed.

In [591]:
df.tail()

        Name  Age  Salary             City    HireDate
95  Lyudmila   30   72635            Kazan  2016-11-30
96    Kirill   27  103208      Novosibirsk  2020-02-29
97    Zhanna   37   73828  SaintPetersburg  2022-12-31
98    Kirill   50   58711            Kazan  2018-01-31
99      Ivan   24   43420    Yekaterinburg  2015-12-31

In [592]:
#just add new
new_row = {"Name": "Anna", "Age": 30, "Salary": 100000, "City": "Moscow", "HireDate": "2020-12-31"}
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)
df.tail()

       Name  Age  Salary             City    HireDate
96   Kirill   27  103208      Novosibirsk  2020-02-29
97   Zhanna   37   73828  SaintPetersburg  2022-12-31
98   Kirill   50   58711            Kazan  2018-01-31
99     Ivan   24   43420    Yekaterinburg  2015-12-31
100    Anna   30  100000           Moscow  2020-12-31

In [593]:
row_to_copy = df.loc[97] 
df = pd.concat([df, pd.DataFrame([row_to_copy])], ignore_index=True)

row_to_copy = df.loc[98] 
df = pd.concat([df, pd.DataFrame([row_to_copy])], ignore_index=True)

row_to_copy = df.loc[99] 
df = pd.concat([df, pd.DataFrame([row_to_copy])], ignore_index=True)

df.tail()

       Name  Age  Salary             City    HireDate
99     Ivan   24   43420    Yekaterinburg  2015-12-31
100    Anna   30  100000           Moscow  2020-12-31
101  Zhanna   37   73828  SaintPetersburg  2022-12-31
102  Kirill   50   58711            Kazan  2018-01-31
103    Ivan   24   43420    Yekaterinburg  2015-12-31

#### Checking for Duplicates

In [594]:
print(df.duplicated().sum())  # Number of duplicates

3

In [595]:
df[df.duplicated()]

       Name  Age  Salary             City    HireDate
101  Zhanna   37   73828  SaintPetersburg  2022-12-31
102  Kirill   50   58711            Kazan  2018-01-31
103    Ivan   24   43420    Yekaterinburg  2015-12-31

#### Removing Duplicates

In [596]:
df = df.drop_duplicates()
# You can also remove duplicates based on specific columns:
df = df.drop_duplicates(subset=['Name'])

In [597]:
df[df.duplicated()]

Empty DataFrame
Columns: [Name, Age, Salary, City, HireDate]
Index: []